Revit 2026 API

# StructuralSectionGeneralHWallNominalThickness Property

---

Represents wall nominal thickness of rectangle.

**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double WallNominalThickness { get; set; }
```
```vb
Public Property WallNominalThickness As Double
	Get
	Set
```
```cpp
public:
property double WallNominalThickness {
	double get ();
	void set (double value);
}
```
```fsharp
member WallNominalThickness : float with get, set
```

#### Property Value

Double

Nominal is measured real value of profile, should be thicker than designed.

#### Reference

StructuralSectionGeneralH Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace